change diagram
